/*
&：取地址操作符【通过变量访问地址】
*：解引用（间接）操作符【通过地址访问变量】
“*”的作用是引用指针指向的变量值，引用就是取地址(&)。
    “解"就是把该地址对应的东西解开，解出来，就像打开一个包裹一样，那就是该变量的值了，所以称为"解引用”。
    也就是说，解引用是返回内存地址中保存的值。
运算符      名称或含义         使用形式
.         成员选择（对象）    对象.成员名 --
->        成员选择（指针）    对象指针->成员名
*/
/*
指针：就是地址
指针变量：以地址为值的变量
表示形式：
    type * pa=&variable //定义一个type类型的指针指向一个名为variable的变量。
指针类型：
    1.关系到指针跨越一步时指针的跨度大小
    2.关系到指针解引用时能操作几个字节(比如： char* 的指针解引用就只能访问一个字节，而 int* 的指针的解引用就能访问四个字节)
32位处理器有32根地址线，相对应指针/地址也就是 00000000000000000000000000000000，为32个bit位/4个字节。
64位处理器就是 0000000000000000000000000000000000000000000000000000000000000000，为64个bit位/8个字节。
指针加整数跳字节数来对应指定指针，指针相减来求数字元素个数
指针数组：例：int* arr[5];
*/
#include<stdio.h>
struct book
{
    //结构体的成员（变量）
    char name[20];
    char id[20];
    int price;
};

int main(){
    int a=NULL;
    int * pa=&a;
    printf("%p",pa);
    return 0;
}